app/Controllers/Home.php

    public function index(): string
    {
        $usersModel = new UsersModel();

        $data['users'] = $usersModel->findAll();
---
SELECT *
FROM `users`

    public function addUser()
    {
        $countriesModel = new CountryModel();
        $countries = $countriesModel->findAll();
---
SELECT *
FROM `countries`

    public function addUsers()
    {
        $usersModel = new UsersModel();

        $username = $this->request->getPost('userName');
        $age = $this->request->getPost('age');
        $country = $this->request->getPost('country');
        $state = $this->request->getPost('state');
        $city = $this->request->getPost('city');


        $image = $this->request->getFile('image');
        $newName = $image->getRandomName();

        if ($image->isValid() && !$image->hasMoved()) {

            $image->move(ROOTPATH . 'public/uploads', $newName);


            $userData = [
                'userName' => $username,
                'age' => $age,
                'country' => $country,
                'state' => $state,
                'city' => $city,
                'image' => $newName
            ];


            $usersModel->insert($userData);
---
INSERT INTO `users` (`userName`, `age`, `country`, `state`, `city`, `image`) VALUES ('bgfg', '112', '101', '19', '1856', '1707721001_0302746b05c1a7f0c728.gif')

    public function getStates($id)
    {
        $statesModel = new StateModel();
        $states = $statesModel->where('countryId', $id)->findAll();
---
SELECT *
FROM `states`
WHERE `countryId` = '7'

    public function getCities($id)
    {
        $citiesModel = new CityModel();
        $cities = $citiesModel->where('stateId', $id)->findAll();
---
SELECT *
FROM `cities`
WHERE `stateId` = '35'